In [1]:
import pandas as pd

In [5]:
data=pd.DataFrame({"a":["one","two"]*3,"b":[1,1,2,3,2,3]})
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [6]:
data.duplicated()#the last two are duplicated because the exact same sequence happened in 23 as in 45

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [8]:
data.drop_duplicates()

     a  b
0  one  1
1  two  1
2  one  2
3  two  3

In [9]:
data["c"]=range(6)
data

     a  b  c
0  one  1  0
1  two  1  1
2  one  2  2
3  two  3  3
4  one  2  4
5  two  3  5

In [14]:
data.duplicated(["a","b"],keep="last")

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [15]:
df=pd.DataFrame({"names":["Tim","tom","Sam","kate","Kim"],"scores":[60,50,70,80,40]})
df

  names  scores
0   Tim      60
1   tom      50
2   Sam      70
3  kate      80
4   Kim      40

In [16]:
classes={"Tim":"A","Tom":"A","Sam":"B","Kate":"B","Kim":"B"}

In [18]:
n=df["names"].str.capitalize()
n

0     Tim
1     Tom
2     Sam
3    Kate
4     Kim
Name: names, dtype: object

In [19]:
df["branches"]=n.map(classes)

In [20]:
df

  names  scores branches
0   Tim      60        A
1   tom      50        A
2   Sam      70        B
3  kate      80        B
4   Kim      40        B

In [27]:
import numpy as np
s=pd.Series([80,70,90,60])
s.replace([70,60],[np.nan,0])

0    80.0
1     NaN
2    90.0
3     0.0
dtype: float64

In [24]:
s.replace({90:100,60:0})

0     80
1     70
2    100
3      0
dtype: int64

In [28]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),index=[0,1,2],columns=["tim","tom","kim","sam"])
df

   tim  tom  kim  sam
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [29]:
s=pd.Series(["one","two","three"])
df.index=df.index.map(s)

In [30]:
df

       tim  tom  kim  sam
one      0    1    2    3
two      4    5    6    7
three    8    9   10   11

In [31]:
df.rename(index=str.title,columns=str.upper)

       TIM  TOM  KIM  SAM
One      0    1    2    3
Two      4    5    6    7
Three    8    9   10   11

In [33]:
df.rename(index={"one":"ten"},columns={"sam":"kate"},inplace=True)
df

       tim  tom  kim  kate
ten      0    1    2     3
two      4    5    6     7
three    8    9   10    11

In [34]:
sc = [30, 80, 40, 90, 60, 45, 95, 75, 55, 100, 65, 85]
x=[20,40,60,80,100]
y=pd.cut(sc,x)
y

[(20, 40], (60, 80], (20, 40], (80, 100], (40, 60], ..., (60, 80], (40, 60], (80, 100], (60, 80], (80, 100]]
Length: 12
Categories (4, interval[int64, right]): [(20, 40] < (40, 60] < (60, 80] < (80, 100]]